# Taps
tap "homebrew/bundle"
tap "jepeake/mtop"

# ===========================================
# CLI Tools
# ===========================================

# Essential
brew "git"
brew "gh"                    # GitHub CLI
brew "wget"
brew "curl"
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor

# Modern CLI replacements
brew "bat"                   # Better cat
brew "eza"                   # Better ls
brew "fd"                    # Better find
brew "ripgrep"               # Better grep
brew "fzf"                   # Fuzzy finder
brew "zoxide"                # Better cd

# System monitoring
brew "btop"                  # Better top
brew "htop"
brew "mtop"                  # Apple Silicon performance monitor

# File management
brew "tree"
brew "trash"                 # Move to trash instead of rm
brew "nnn"                   # Terminal file manager

# Development
brew "tmux"                  # Terminal multiplexer
brew "neovim"
brew "lazygit"               # Git TUI
brew "delta"                 # Better git diff

# Python
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"

# Node.js
brew "node"
brew "nvm"

# Utilities
brew "mole"                  # Deep clean and optimize Mac
brew "tldr"                  # Simplified man pages
brew "watch"
brew "mas"                   # Mac App Store CLI

# ===========================================
# Fonts (for Powerlevel10k)
# ===========================================
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ===========================================
# GUI Applications
# ===========================================

# Terminals & Editors
cask "ghostty"
cask "cursor"
cask "zed"

# Development
cask "docker"
cask "jetbrains-toolbox"

# Productivity
cask "obsidian"

# Communication
cask "zoom"

# Browsers
cask "brave-browser"

# Media
cask "vlc"
cask "obs"

# Utilities
cask "maccy"                 # Clipboard manager
cask "the-unarchiver"
